#include<iostream>
using namespace std;
int main()
{
int n,m,i,j,k;
cin>>n;
char a[n][n];
for(i=0;i<n;i++)
   cin>>a[i];
cin>>m;
int num=0;//患病人数num
for(k=0;k<m;k++)
{
for(i=0;i<n;i++)
   {
   for(j=0;j<n;j++)
      {
      if(a[i][j]=='!')
         a[i][j]='@';
      }
   }
for(i=0;i<n;i++)
   {
   for(j=0;j<n;j++)
      {
      if(a[i][j]='.')
         {
         if((i==0)&&(j==0)&&((a[i+1][j]=='@')||(a[i][j+1]=='@')))//左上角
            a[i][j]='!';
         else if((i==0)&&(j=n-1)&&((a[i+1][j]=='@')||(a[i][j-1]=='@')))//右上角
            a[i][j]='!';
         else if((i=n-1)&&(j=0)&&((a[i-1][j]=='@')||(a[i][j+1]=='@')))//左下角
            a[i][j]='!';
         else if((i==n-1)&&(j==n-1)&&((a[i-1][j]=='@')||(a[i][j-1]=='@')))//右下角
            a[i][j]='!';
         else if((i==0)&&((a[i][j-1]=='@')||(a[i][j+1]=='@')||(a[i+1][j]=='@')))//除去角落的第一行
            a[i][j]='!';
         else if((i=n-1)&&((a[i][j-1]=='@')||(a[i][j+1]=='@')||(a[i-1][j]=='@')))//除去角落的最后一行
            a[i][j]='!';
         else if((j=0)&&((a[i+1][j]=='@')||(a[i-1][j]=='@')||(a[i][j+1]=='@')))//除去角落的第一列
            a[i][j]='!';
         else if((j=n-1)&&((a[i+1][j]=='@')||(a[i-1][j]=='@')||(a[i][j-1]=='@')))//除去角落的最后一列
            a[i][j]='!';
         else if((a[i][j+1]=='@')||(a[i][j-1]=='@')||(a[i-1][j]=='@')||(a[i+1][j]=='@'))//不靠边的内部
            a[i][j]='!';
         }
      }
   }
}
for(i=0;i<n;i++)
   {
   for(j=0;j<n;j++)
      {
      if(a[i][j]=='@')
         num++;
      }
   }
cout<<num<<endl;
return 0;
}
